Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties.DesignGroup Property
 The design group of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string DesignGroup { get; set; }
Public Property DesignGroup As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisPartAnalysisProperties Class
Tekla.Structures.Analysis Namespace